In [1]:
from urllib.parse import quote
encoded_password = quote("Mubeen@12345", safe="")
connection_string = f"mysql+pymysql://sweeterror404:{encoded_password}@localhost:3306/mubeen"
%load_ext sql
%sql $connection_string

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">WITH (Common Table Expressions)</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>A common table expression (CTE) is a named temporary result set that exists within the scope of a single statement and that can be referred to later within that statement, possibly multiple times. </ul>
</div>

In [8]:
%sql SELECT * FROM laptop_bk Limit 3

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0')),
 (2, 'Apple', 'Ultrabook', Decimal('13.3'), 1440, 900, 0, 0, 'Intel', 'Core i5', Decimal('1.8'), 8, 'Flash Storage', 128, 0, 'Intel', ' HD Graphics 6000', 'Mac', Decimal('1.3'), Decimal('47896.0')),
 (3, 'HP', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Core 7200U', Decimal('2.5'), 8, 'SSD', 256, 0, 'Intel', ' HD Graphics 620', 'N/A', Decimal('1.9'), Decimal('30636.0'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now i need Only this 3 rows data <br> SO we can't store multiples columns data in single variable<br><br>Like
</div>

In [12]:
%%sql 
SET @mysdata = (SELECT * FROM laptop_bk Limit 3)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (1241, 'Operand should contain 1 column(s)')
[SQL: SET @mysdata = (SELECT * FROM laptop_bk Limit 3)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">So Here CTF are usefull
</div>

In [ ]:
# WITH alias AS (query)
        # now it is important to use alias
# SELECT * FROM alias

In [15]:
%%sql
WITH mydata AS (SELECT * FROM laptop_bk LIMIT 3)
SELECT * FROM mydata

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0')),
 (2, 'Apple', 'Ultrabook', Decimal('13.3'), 1440, 900, 0, 0, 'Intel', 'Core i5', Decimal('1.8'), 8, 'Flash Storage', 128, 0, 'Intel', ' HD Graphics 6000', 'Mac', Decimal('1.3'), Decimal('47896.0')),
 (3, 'HP', 'Notebook', Decimal('15.6'), 1920, 1080, 0, 0, 'Intel', 'Core 7200U', Decimal('2.5'), 8, 'SSD', 256, 0, 'Intel', ' HD Graphics 620', 'N/A', Decimal('1.9'), Decimal('30636.0'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Count the data rows
</div>

In [20]:
%%sql
WITH mydata AS (SELECT * FROM laptop_bk LIMIT 3)
SELECT COUNT(*) FROM mydata

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(3,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 2
</div>

In [35]:
%sql SELECT * FROM students

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'Ali', 20), (2, 'Sara', 22), (3, 'Ahmed', 21)]

In [36]:
%sql SELECT * FROM grades

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
6 rows affected.

[(1, 'Math', 'A'),
 (1, 'English', 'B'),
 (2, 'Math', 'B'),
 (2, 'English', 'A'),
 (3, 'Math', 'C'),
 (3, 'English', 'A')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 3
</div>

In [40]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[(1, 'John', 101), (2, 'Alice', 102), (3, 'Bob', 101), (4, 'Eva', 103)]

In [89]:
%%sql

WITH data AS (
        SELECT t1.employee_name AS n1,t2.employee_name AS n2 FROM employees t1
        CROSS JOIN employees t2
        ON t1.employee_id != t2.employee_id)


SELECT * FROM data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
12 rows affected.

[('Eva', 'John'),
 ('Bob', 'John'),
 ('Alice', 'John'),
 ('Eva', 'Alice'),
 ('Bob', 'Alice'),
 ('John', 'Alice'),
 ('Eva', 'Bob'),
 ('Alice', 'Bob'),
 ('John', 'Bob'),
 ('Bob', 'Eva'),
 ('Alice', 'Eva'),
 ('John', 'Eva')]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">rename column in cte</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">We also add a new column names in () brackets
</div>

In [99]:
%%sql

WITH data AS (
        SELECT t1.employee_name ,t2.employee_name FROM employees t1
        CROSS JOIN employees t2
        ON t1.employee_id != t2.employee_id)


SELECT * FROM data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (1060, "Duplicate column name 'employee_name'")
[SQL: WITH data AS (
        SELECT t1.employee_name ,t2.employee_name FROM employees t1
        CROSS JOIN employees t2
        ON t1.employee_id != t2.employee_id)


SELECT * FROM data]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here i apply cross join and i cant use AS (alias) than means column name are same So here we need to use renames
</div>

In [100]:
%%sql

WITH data(emp1,emp2) AS (
        SELECT t1.employee_name ,t2.employee_name FROM employees t1
        CROSS JOIN employees t2
        ON t1.employee_id != t2.employee_id)


SELECT * FROM data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
12 rows affected.

[('Eva', 'John'),
 ('Bob', 'John'),
 ('Alice', 'John'),
 ('Eva', 'Alice'),
 ('Bob', 'Alice'),
 ('John', 'Alice'),
 ('Eva', 'Bob'),
 ('Alice', 'Bob'),
 ('John', 'Bob'),
 ('Bob', 'Eva'),
 ('Alice', 'Eva'),
 ('John', 'Eva')]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Two types of Scenarios used CTE</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">We can use Common Table Expressions (CTEs) as subqueries in different scenarios.
    <ul><li>At the beginning of subqueries (including derived table subqueries):</li>
        <li>In derived table subqueries:</li>
    </ul>
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>beginning Example</ul>
</div>

In [108]:
%%sql

WITH id AS (
    SELECT
    employee_id,
    employee_name
  FROM employees
  WHERE department_id = 101
)

SELECT * FROM id;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'John'), (3, 'Bob')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>derived Example</ul>
</div>

In [116]:
%%sql
WITH t1(e1) AS (SELECT employee_name FROM employees),
     t2(e2) AS (SELECT employee_name FROM employees)

SELECT * FROM t1
CROSS JOIN t2 ON t1.e1 != t2.e2

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
12 rows affected.

[('Eva', 'John'),
 ('Bob', 'John'),
 ('Alice', 'John'),
 ('Eva', 'Alice'),
 ('Bob', 'Alice'),
 ('John', 'Alice'),
 ('Eva', 'Bob'),
 ('Alice', 'Bob'),
 ('John', 'Bob'),
 ('Bob', 'Eva'),
 ('Alice', 'Eva'),
 ('John', 'Eva')]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">CTE with INSERT</h1>

In [117]:
%sql SELECT * FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0'))]

In [162]:
%%sql
SELECT * FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0'))]

In [129]:
%%sql
WITH data AS (
    SELECT id,Company,Price FROM (SELECT *,
    ROW_NUMBER() OVER (PARTITION BY Company ORDER BY Price DESC) AS mx_price
    FROM laptop_bk) t1
    WHERE t1.mx_price = 1
)

SELECT * FROM data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
19 rows affected.

[(1160, 'Acer', Decimal('138475.0')),
 (18, 'Apple', Decimal('152274.0')),
 (1037, 'Asus', Decimal('211788.0')),
 (410, 'Chuwi', Decimal('23923.0')),
 (705, 'Dell', Decimal('194973.0')),
 (609, 'Fujitsu', Decimal('42571.0')),
 (426, 'Google', Decimal('117163.0')),
 (729, 'HP', Decimal('233846.0')),
 (206, 'Huawei', Decimal('79867.0')),
 (597, 'Lenovo', Decimal('261019.0')),
 (661, 'LG', Decimal('122491.0')),
 (567, 'Mediacom', Decimal('20726.0')),
 (438, 'Microsoft', Decimal('137942.0')),
 (172, 'MSI', Decimal('149131.0')),
 (190, 'Razer', Decimal('324955.0')),
 (851, 'Samsung', Decimal('98515.0')),
 (479, 'Toshiba', Decimal('149131.0')),
 (185, 'Vero', Decimal('13853.0')),
 (502, 'Xiaomi', Decimal('74589.0'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>Here 1=0 means dont need a values JUST create new table</ul>
</div>

In [135]:
%%sql
WITH data AS (
    SELECT id,Company,Price FROM (SELECT *,
    ROW_NUMBER() OVER (PARTITION BY Company ORDER BY Price DESC) AS mx_price
    FROM laptop_bk) t1
    WHERE t1.mx_price = 1
)

SELECT * FROM data WHERE 1=0

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>Now Create only Table</ul>
</div>

In [136]:
%%sql
CREATE TABLE mx_price_laptop AS

WITH data AS (
    SELECT id,Company,Price FROM (SELECT *,
    ROW_NUMBER() OVER (PARTITION BY Company ORDER BY Price DESC) AS mx_price
    FROM laptop_bk) t1
    WHERE t1.mx_price = 1
)

SELECT * FROM data WHERE 1=0

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [137]:
%sql SELECT * FROM mx_price_laptop

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>Insert Value</ul>
</div>

In [138]:
%%sql

INSERT INTO mx_price_laptop

WITH data AS (
    SELECT id,Company,Price FROM (SELECT *,
    ROW_NUMBER() OVER (PARTITION BY Company ORDER BY Price DESC) AS mx_price
    FROM laptop_bk) t1
    WHERE t1.mx_price = 1
)

SELECT * FROM data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
19 rows affected.

[]

In [139]:
%sql SELECT * FROM mx_price_laptop

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
19 rows affected.

[(1160, 'Acer', Decimal('138475.0')),
 (18, 'Apple', Decimal('152274.0')),
 (1037, 'Asus', Decimal('211788.0')),
 (410, 'Chuwi', Decimal('23923.0')),
 (705, 'Dell', Decimal('194973.0')),
 (609, 'Fujitsu', Decimal('42571.0')),
 (426, 'Google', Decimal('117163.0')),
 (729, 'HP', Decimal('233846.0')),
 (206, 'Huawei', Decimal('79867.0')),
 (597, 'Lenovo', Decimal('261019.0')),
 (661, 'LG', Decimal('122491.0')),
 (567, 'Mediacom', Decimal('20726.0')),
 (438, 'Microsoft', Decimal('137942.0')),
 (172, 'MSI', Decimal('149131.0')),
 (190, 'Razer', Decimal('324955.0')),
 (851, 'Samsung', Decimal('98515.0')),
 (479, 'Toshiba', Decimal('149131.0')),
 (185, 'Vero', Decimal('13853.0')),
 (502, 'Xiaomi', Decimal('74589.0'))]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Nested Level CTE</h1>

In [144]:
%%sql

SELECT id,Company,Price FROM (SELECT *,
    ROW_NUMBER() OVER (PARTITION BY Company ORDER BY Price DESC) AS mx_price
    FROM laptop_bk) t1
    WHERE t1.mx_price = 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
19 rows affected.

[(1160, 'Acer', Decimal('138475.0')),
 (18, 'Apple', Decimal('152274.0')),
 (1037, 'Asus', Decimal('211788.0')),
 (410, 'Chuwi', Decimal('23923.0')),
 (705, 'Dell', Decimal('194973.0')),
 (609, 'Fujitsu', Decimal('42571.0')),
 (426, 'Google', Decimal('117163.0')),
 (729, 'HP', Decimal('233846.0')),
 (206, 'Huawei', Decimal('79867.0')),
 (597, 'Lenovo', Decimal('261019.0')),
 (661, 'LG', Decimal('122491.0')),
 (567, 'Mediacom', Decimal('20726.0')),
 (438, 'Microsoft', Decimal('137942.0')),
 (172, 'MSI', Decimal('149131.0')),
 (190, 'Razer', Decimal('324955.0')),
 (851, 'Samsung', Decimal('98515.0')),
 (479, 'Toshiba', Decimal('149131.0')),
 (185, 'Vero', Decimal('13853.0')),
 (502, 'Xiaomi', Decimal('74589.0'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>Now extract max Price laptop with nested cte</ul>
</div>

In [146]:
%%sql

WITH 

  all_data AS ( 
          SELECT *,
          ROW_NUMBER() OVER (PARTITION BY Company ORDER BY Price DESC) AS mx_price
          FROM laptop_bk
         ),
  
mx_price AS ( 
        SELECT 
        id,Company,Price
        FROM all_data
        WHERE mx_price = 1
  )

SELECT * FROM mx_price;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
19 rows affected.

[(1160, 'Acer', Decimal('138475.0')),
 (18, 'Apple', Decimal('152274.0')),
 (1037, 'Asus', Decimal('211788.0')),
 (410, 'Chuwi', Decimal('23923.0')),
 (705, 'Dell', Decimal('194973.0')),
 (609, 'Fujitsu', Decimal('42571.0')),
 (426, 'Google', Decimal('117163.0')),
 (729, 'HP', Decimal('233846.0')),
 (206, 'Huawei', Decimal('79867.0')),
 (597, 'Lenovo', Decimal('261019.0')),
 (661, 'LG', Decimal('122491.0')),
 (567, 'Mediacom', Decimal('20726.0')),
 (438, 'Microsoft', Decimal('137942.0')),
 (172, 'MSI', Decimal('149131.0')),
 (190, 'Razer', Decimal('324955.0')),
 (851, 'Samsung', Decimal('98515.0')),
 (479, 'Toshiba', Decimal('149131.0')),
 (185, 'Vero', Decimal('13853.0')),
 (502, 'Xiaomi', Decimal('74589.0'))]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Recursive CTE</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>A Recursive Common Table Expression (CTE) is used to refer to itself within a query. <ul><li>This means that a CTE can include its own parts, creating a loop or recursion.</li><li>To define a Recursive CTE, the WITH clause is used, and the keyword RECURSIVE is added.</li><li>They use the UNION or UNION ALL to combine the initial query with its subsequent recursive parts</li></ul></ul>
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Lets Step By Step Understand
</div>

In [59]:
%%sql
SET @var = 1;
WITH RECURSIVE cte(n) AS (SELECT @var) -- here var(1) are pass in cte(n)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
1 rows affected.

[(1,)]

In [60]:
%%sql
WITH RECURSIVE cte(n) AS (SELECT 1) -- here 1 are pass in the n
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1,)]

In [66]:
%%sql
-- HERE 1,2 TAKE A UNION 
WITH RECURSIVE cte(n) AS (SELECT 1 UNION SELECT 2)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1,), (2,)]

In [71]:
%%sql
-- HERE 1,2,3 TAKE A UNION 
WITH RECURSIVE cte(n) AS (SELECT 1 UNION SELECT 2 UNION SELECT 3)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1,), (2,), (3,)]

In [82]:
%%sql
-- here i use nested cte that call yourself
WITH RECURSIVE cte(n) AS (SELECT 1 UNION SELECT n FROM cte)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Now need to increment n value and also need to break the Recursive condition
</div>

In [117]:
%%sql
WITH RECURSIVE cte(i) AS (SELECT 1 UNION SELECT i+1 FROM cte WHERE i < 5)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1,), (2,), (3,), (4,), (5,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Example 2 with two parameters
</div>

In [121]:
%%sql
SET @name = 'Mubeen';
WITH RECURSIVE cte(i,j) AS (SELECT 1,@name UNION SELECT i+1,j FROM cte WHERE i < 5)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
5 rows affected.

[(1, 'Mubeen'), (2, 'Mubeen'), (3, 'Mubeen'), (4, 'Mubeen'), (5, 'Mubeen')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Example 3
</div>

In [122]:
%%sql
SET @name = 'Mubeen';

WITH RECURSIVE cte AS (SELECT 1 AS iteration,@name AS string UNION SELECT iteration+1,string FROM cte WHERE iteration < 5)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
5 rows affected.

[(1, 'Mubeen'), (2, 'Mubeen'), (3, 'Mubeen'), (4, 'Mubeen'), (5, 'Mubeen')]

In [143]:
%%sql
SET @name = 'Mubeen';

SELECT SUBSTRING(@name,6,1)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
1 rows affected.

[('n',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Iteration Example
</div>

In [178]:
%%sql
SET @name = 'Mubeen';

WITH RECURSIVE cte(i,str) AS (
                    SELECT 1,SUBSTRING(@name,1,1)
                        UNION
                    SELECT i+1,SUBSTRING(@name,i+1,1) FROM cte WHERE i < LENGTH(@name)
                    )

SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
6 rows affected.

[(1, 'M'), (2, 'u'), (3, 'b'), (4, 'e'), (5, 'e'), (6, 'n')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> We also use LIMIT instead of condition
</div>

In [185]:
%%sql
WITH RECURSIVE cte(i) AS (SELECT 1 UNION SELECT i+1 FROM cte LIMIT 5)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1,), (2,), (3,), (4,), (5,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">  You can also set the global cte_max_recursion_depth value to affect all sessions that begin subsequently. 
</div>

In [194]:
%%sql
SET SESSION cte_max_recursion_depth = 3;      -- permit only shallow recursion
# SET SESSION cte_max_recursion_depth = 1000000; -- permit deeper recursion

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [196]:
%%sql
WITH RECURSIVE cte(i) AS (SELECT 1 UNION SELECT i+1 FROM cte LIMIT 5)
SELECT * FROM cte;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (3636, 'Recursive query aborted after 4 iterations. Try increasing @@cte_max_recursion_depth to a larger value.')
[SQL: WITH RECURSIVE cte(i) AS (SELECT 1 UNION SELECT i+1 FROM cte LIMIT 5)
SELECT * FROM cte;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [197]:
%%sql
SET SESSION cte_max_recursion_depth = 8 -- change the max depth

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [198]:
%%sql
WITH RECURSIVE cte(i) AS (SELECT 1 UNION SELECT i+1 FROM cte LIMIT 5)
SELECT * FROM cte; -- now its worked

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1,), (2,), (3,), (4,), (5,)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Fibonacci Series 
</div>

In [204]:
%%sql
SET SESSION cte_max_recursion_depth = 100000;

WITH RECURSIVE fibonacci (n, fib_n, next_fib_n) AS
(
  SELECT 1, 0, 1
  UNION ALL
  SELECT n + 1, next_fib_n, fib_n + next_fib_n
    FROM fibonacci WHERE n < 10
)
SELECT * FROM fibonacci;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
10 rows affected.

[(1, 0, 1),
 (2, 1, 1),
 (3, 1, 2),
 (4, 2, 3),
 (5, 3, 5),
 (6, 5, 8),
 (7, 8, 13),
 (8, 13, 21),
 (9, 21, 34),
 (10, 34, 55)]

In [258]:
%%sql

SET @end = 8;

WITH RECURSIVE fib(i,fib_no,next) AS ( 
    
        SELECT 1, 0 , 1
    
        UNION ALL 

        SELECT i+1, next, fib_no+next FROM fib WHERE i < @end)

SELECT * FROM fib;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
8 rows affected.

[(1, 0, 1),
 (2, 1, 1),
 (3, 1, 2),
 (4, 2, 3),
 (5, 3, 5),
 (6, 5, 8),
 (7, 8, 13),
 (8, 13, 21)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Also sum of total number 
</div>

In [260]:
%%sql

SET @end = 8;

WITH RECURSIVE fib(i,fib_no,next) AS ( 
    
        SELECT 1, 0 , 1
    
        UNION ALL 

        SELECT i+1, next, fib_no+next FROM fib WHERE i < @end)

SELECT SUM(fib_no) FROM fib;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
1 rows affected.

[(Decimal('33'),)]